<a href="https://colab.research.google.com/github/pawanGithub10/MachineLearning/blob/main/PandasFinance.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

In [4]:
import numpy as np
import pandas as pd

In [8]:
df = pd.DataFrame(np.array([[10,11],[20,21]]),columns=['a','b'],index = ['r1','r2'])
df

     a   b
r1  10  11
r2  20  21

In [9]:
df.index

Index(['r1', 'r2'], dtype='object')

In [10]:
df.values

array([[10, 11],
       [20, 21]])

In [15]:
sp500 = pd.read_csv('/content/drive/My Drive/Academics/Research/Finance/Chapter1/sp500.csv',index_col = 'Symbol',usecols=[0,2,3,7])
sp500.head()

                        Sector   Price  Book Value
Symbol
MMM                Industrials  141.14      26.668
ABT                Health Care   39.60      15.573
ABBV               Health Care   53.95       2.954
ACN     Information Technology   79.79       8.326
ACE                 Financials  102.91      86.897

In [16]:
sp500.index

Index(['MMM', 'ABT', 'ABBV', 'ACN', 'ACE', 'ACT', 'ADBE', 'AES', 'AET', 'AFL',
       ...
       'XEL', 'XRX', 'XLNX', 'XL', 'XYL', 'YHOO', 'YUM', 'ZMH', 'ZION', 'ZTS'],
      dtype='object', name='Symbol', length=500)

In [21]:
sp500.iloc[:,[1,2]].head(3)

         Price  Book Value
Symbol
MMM     141.14      26.668
ABT      39.60      15.573
ABBV     53.95       2.954

In [24]:
sp500.iloc[:,[1]].head(3)

         Price
Symbol
MMM     141.14
ABT      39.60
ABBV     53.95

In [25]:
sp500['Price']

Symbol
MMM     141.14
ABT      39.60
ABBV     53.95
ACN      79.79
ACE     102.91
         ...
YHOO     35.02
YUM      74.77
ZMH     101.84
ZION     28.43
ZTS      30.53
Name: Price, Length: 500, dtype: float64

In [27]:
sp500[['Price','Sector']]

         Price                  Sector
Symbol
MMM     141.14             Industrials
ABT      39.60             Health Care
ABBV     53.95             Health Care
ACN      79.79  Information Technology
ACE     102.91              Financials
...        ...                     ...
YHOO     35.02  Information Technology
YUM      74.77  Consumer Discretionary
ZMH     101.84             Health Care
ZION     28.43              Financials
ZTS      30.53             Health Care

[500 rows x 2 columns]

In [28]:
sp500.Price

Symbol
MMM     141.14
ABT      39.60
ABBV     53.95
ACN      79.79
ACE     102.91
         ...
YHOO     35.02
YUM      74.77
ZMH     101.84
ZION     28.43
ZTS      30.53
Name: Price, Length: 500, dtype: float64

In [29]:
sp500[:3]

             Sector   Price  Book Value
Symbol
MMM     Industrials  141.14      26.668
ABT     Health Care   39.60      15.573
ABBV    Health Care   53.95       2.954

In [30]:
sp500['XYL':'YUM']

                        Sector  Price  Book Value
Symbol
XYL                Industrials  38.42      12.127
YHOO    Information Technology  35.02      12.768
YUM     Consumer Discretionary  74.77       5.147

In [31]:
sp500.loc['MMM']

Sector        Industrials
Price              141.14
Book Value         26.668
Name: MMM, dtype: object

In [35]:
sp500.loc[['MMM','ADBE']]

                        Sector   Price  Book Value
Symbol
MMM                Industrials  141.14      26.668
ADBE    Information Technology   64.30      13.262

In [36]:
sp500.iloc[[0,2]]

             Sector   Price  Book Value
Symbol
MMM     Industrials  141.14      26.668
ABBV    Health Care   53.95       2.954